openFoamCase/0/p
/*--------------------------------*- C++ -*----------------------------------*\
|       o          |                                                          |
|    o     o       | HELYX-OS                                                  |
|   o   O   o      | Version: v2.4.0                                           |
|    o     o       | Web:     http://www.engys.com                            |
|       o          |                                                          |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version 2.0;
    format ascii;
    class volScalarField;
    location "0";
    object p;
}
dimensions [ 0 2 -2 0 0 0 0 ];
internalField uniform 0.0;
boundaryField
{
    pressure-outlet
    {
        type fixedValue;
        value uniform 0.0;
    }

    velocity-inlet-1
    {
        type zeroGradient;
    }

    velocity-inlet-2
    {
        type zeroGradient;
    }

    walls
    {
        type zeroGradient;
    }

}
