openFoamCase/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
|       o          |                                                          |
|    o     o       | HELYX-OS                                                  |
|   o   O   o      | Version: v2.4.0                                           |
|    o     o       | Web:     http://www.engys.com                            |
|       o          |                                                          |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version 2.0;
    format ascii;
    class dictionary;
    location system;
    object fvSolution;
}

    PIMPLE
    {
        momentumPredictor yes;
        nOuterCorrectors 2;
        nCorrectors 2;
        nNonOrthogonalCorrectors 2;
        pRefCell 0;
        pRefValue 0;
        rhoMin rhoMin [1 -3 0 0 0 0 0 ] 0.5;
        rhoMax rhoMax [1 -3 0 0 0 0 0 ] 2.0;
        residualControl
        {
            U
            {
                relTol 0.05;
                tolerance 1.0E-6;
            }

            k
            {
                relTol 0;
                tolerance 0.0001;
            }

            epsilon
            {
                relTol 0;
                tolerance 0.0001;
            }

            omega
            {
                relTol 0;
                tolerance 0.0001;
            }

            nuTilda
            {
                relTol 0;
                tolerance 0.0001;
            }

            T
            {
                relTol 0;
                tolerance 0.0001;
            }

            p_rgh
            {
                relTol 0;
                tolerance 0.0001;
            }

            p
            {
                relTol 0;
                tolerance 1.0E-5;
            }

            "alpha.*"
            {
                relTol 0;
                tolerance 0.0001;
            }

        }

    }

    solvers
    {
        p
        {
            solver GAMG;
            agglomerator faceAreaPair;
            mergeLevels 1;
            cacheAgglomeration true;
            nCellsInCoarsestLevel 200;
            tolerance 1e-10;
            relTol 0.01;
            smoother GaussSeidel;
            nPreSweeps 0;
            nPostSweeps 2;
            nFinestSweeps 2;
            minIter 1;
        }

        p_rgh
        {
            solver GAMG;
            agglomerator faceAreaPair;
            mergeLevels 1;
            cacheAgglomeration true;
            nCellsInCoarsestLevel 200;
            tolerance 1e-10;
            relTol 0.01;
            smoother GaussSeidel;
            nPreSweeps 0;
            nPostSweeps 2;
            nFinestSweeps 2;
            minIter 1;
        }

        f
        {
            solver GAMG;
            agglomerator faceAreaPair;
            mergeLevels 1;
            cacheAgglomeration true;
            nCellsInCoarsestLevel 200;
            tolerance 1e-10;
            relTol 0.01;
            smoother GaussSeidel;
            nPreSweeps 0;
            nPostSweeps 2;
            nFinestSweeps 2;
            minIter 1;
        }

        pFinal
        {
            solver GAMG;
            smoother GaussSeidel;
            agglomerator faceAreaPair;
            mergeLevels 1;
            cacheAgglomeration true;
            nCellsInCoarsestLevel 200;
            tolerance 1e-6;
            relTol 0;
            nPreSweeps 0;
            nPostSweeps 2;
            nFinestSweeps 2;
            minIter 1;
        }

        p_rghFinal
        {
            solver GAMG;
            smoother GaussSeidel;
            agglomerator faceAreaPair;
            mergeLevels 1;
            cacheAgglomeration true;
            nCellsInCoarsestLevel 200;
            tolerance 1e-6;
            relTol 0;
            nPreSweeps 0;
            nPostSweeps 2;
            nFinestSweeps 2;
            minIter 1;
        }

        fFinal
        {
            solver GAMG;
            smoother GaussSeidel;
            agglomerator faceAreaPair;
            mergeLevels 1;
            cacheAgglomeration true;
            nCellsInCoarsestLevel 200;
            tolerance 1e-6;
            relTol 0;
            nPreSweeps 0;
            nPostSweeps 2;
            nFinestSweeps 2;
            minIter 1;
        }

        U
        {
            solver smoothSolver;
            smoother GaussSeidel;
            tolerance 1e-6;
            relTol 0.1;
            minIter 1;
        }

        k
        {
            solver smoothSolver;
            smoother GaussSeidel;
            tolerance 1e-6;
            relTol 0.1;
            minIter 1;
        }

        kl
        {
            solver smoothSolver;
            smoother GaussSeidel;
            tolerance 1e-6;
            relTol 0.1;
            minIter 1;
        }

        kt
        {
            solver smoothSolver;
            smoother GaussSeidel;
            tolerance 1e-6;
            relTol 0.1;
            minIter 1;
        }

        q
        {
            solver smoothSolver;
            smoother GaussSeidel;
            tolerance 1e-6;
            relTol 0.1;
            minIter 1;
        }

        zeta
        {
            solver smoothSolver;
            smoother GaussSeidel;
            tolerance 1e-6;
            relTol 0.1;
            minIter 1;
        }

        epsilon
        {
            solver smoothSolver;
            smoother GaussSeidel;
            tolerance 1e-6;
            relTol 0.1;
            minIter 1;
        }

        R
        {
            solver smoothSolver;
            smoother GaussSeidel;
            tolerance 1e-6;
            relTol 0.1;
            minIter 1;
        }

        nuTilda
        {
            solver smoothSolver;
            smoother GaussSeidel;
            tolerance 1e-6;
            relTol 0.1;
            minIter 1;
        }

        omega
        {
            solver smoothSolver;
            smoother GaussSeidel;
            tolerance 1e-6;
            relTol 0.1;
            minIter 1;
        }

        h
        {
            solver smoothSolver;
            smoother GaussSeidel;
            tolerance 1e-6;
            relTol 0.1;
            minIter 1;
        }

        T
        {
            solver smoothSolver;
            smoother GaussSeidel;
            tolerance 1e-6;
            relTol 0.1;
            minIter 1;
        }

        v2
        {
            solver smoothSolver;
            smoother GaussSeidel;
            tolerance 1e-6;
            relTol 0.1;
            minIter 1;
        }

        UFinal
        {
            solver smoothSolver;
            smoother GaussSeidel;
            tolerance 1e-6;
            relTol 0;
            minIter 1;
        }

        kFinal
        {
            solver smoothSolver;
            smoother GaussSeidel;
            tolerance 1e-6;
            relTol 0;
            minIter 1;
        }

        klFinal
        {
            solver smoothSolver;
            smoother GaussSeidel;
            tolerance 1e-6;
            relTol 0;
            minIter 1;
        }

        ktFinal
        {
            solver smoothSolver;
            smoother GaussSeidel;
            tolerance 1e-6;
            relTol 0;
            minIter 1;
        }

        qFinal
        {
            solver smoothSolver;
            smoother GaussSeidel;
            tolerance 1e-6;
            relTol 0;
            minIter 1;
        }

        zetaFinal
        {
            solver smoothSolver;
            smoother GaussSeidel;
            tolerance 1e-6;
            relTol 0;
            minIter 1;
        }

        epsilonFinal
        {
            solver smoothSolver;
            smoother GaussSeidel;
            tolerance 1e-6;
            relTol 0;
            minIter 1;
        }

        RFinal
        {
            solver smoothSolver;
            smoother GaussSeidel;
            tolerance 1e-6;
            relTol 0;
            minIter 1;
        }

        nuTildaFinal
        {
            solver smoothSolver;
            smoother GaussSeidel;
            tolerance 1e-6;
            relTol 0;
            minIter 1;
        }

        omegaFinal
        {
            solver smoothSolver;
            smoother GaussSeidel;
            tolerance 1e-6;
            relTol 0;
            minIter 1;
        }

        hFinal
        {
            solver smoothSolver;
            smoother GaussSeidel;
            tolerance 1e-6;
            relTol 0;
            minIter 1;
        }

        TFinal
        {
            solver smoothSolver;
            smoother GaussSeidel;
            tolerance 1e-6;
            relTol 0;
            minIter 1;
        }

        v2Final
        {
            solver smoothSolver;
            smoother GaussSeidel;
            tolerance 1e-6;
            relTol 0;
            minIter 1;
        }

        rho
        {
            solver PCG;
            preconditioner DIC;
            tolerance 0;
            relTol 0;
            minIter 1;
        }

        rhoFinal
        {
            solver PCG;
            preconditioner DIC;
            tolerance 0;
            relTol 0;
            minIter 1;
        }

        e
        {
            solver PBiCG;
            preconditioner DILU;
            tolerance 1e-06;
            relTol 0.1;
            minIter 1;
        }

        Phi
        {
            solver GAMG;
            agglomerator faceAreaPair;
            mergeLevels 1;
            cacheAgglomeration true;
            nCellsInCoarsestLevel 200;
            tolerance 1e-7;
            relTol 0.01;
            smoother GaussSeidel;
            nPreSweeps 0;
            nPostSweeps 2;
            nFinestSweeps 2;
            minIter 1;
        }

    }

    relaxationFactors
    {
        fields
        {
            p 1.0;
            p_rgh 1;
            rho 1;
        }

        equations
        {
            epsilon 1;
            f 1;
            h 1;
            k 1;
            kl 1;
            kt 1;
            nuTilda 1;
            omega 1;
            q 1;
            R 1;
            T 1;
            U 1.0;
            v2 1;
            zeta 1;
            "alpha.*" 1;
            epsilonFinal 1;
            fFinal 1;
            hFinal 1;
            kFinal 1;
            klFinal 1;
            ktFinal 1;
            nuTildaFinal 1;
            omegaFinal 1;
            qFinal 1;
            RFinal 1;
            TFinal 1;
            UFinal 1.0;
            v2Final 1;
            zetaFinal 1;
            "alpha.*Final" 1;
        }

    }
