openFoamCase/system/customNodeDict
/*--------------------------------*- C++ -*----------------------------------*\
|       o          |                                                          |
|    o     o       | HELYX-OS                                                  |
|   o   O   o      | Version: v2.4.0                                           |
|    o     o       | Web:     http://www.engys.com                            |
|       o          |                                                          |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version 2.0;
    format ascii;
    class dictionary;
    location system;
    object customNodeDict;
}

    0
    {
        helyx_type directory;
    }

    constant
    {
        helyx_type directory;
    }

    system
    {
        helyx_type directory;
    }
